{
  "1": "You will find this screen after logging into your DGFT account.",
  "2": "Select e-RCMC.",
  "3": "Click on the Apply for e-RCMC explore button.",
  "4": "Click on start fresh application.",
  "5": "It will display details pre-filled.",
  "6": "Agree to the declaration and click on Save and Next.",
  "7": "Now scroll down to find the first step.",
  "8": "Fill in the necessary details. To know about the name of your export promotion council, check out https://www.commerce.gov.in/useful-links/export-promotion-councils/.",
  "9": "Click on YES.",
  "10": "In case you have not paid any amount through EPC or CB outside the portal, press NO. Check whether you want to print the Branch address as Annexure-I to RCMC certificate.",
  "11": "In case you have not paid any amount through EPC or CB outside the portal, press YES.",
  "12": "A pop-up will show up. Click OK and now fill all the details of your payment. Check whether you want to print the Branch address as Annexure-I to RCMC certificate.",
  "13": "Select the office for submission of application and fill all other required details.",
  "14": "",
  "15": "Now select the certification for your respective product and fill in the certification details, and click the dropdown to move to the next step.",
  "16": "Select export products (since we are exporting) and one by one select the ITC(HS) code for your product, the description will be generated and then click on add.",
  "17": "Click the dropdown menu to add authorised representative's details.",
  "18": "Add the necessary details and click on add details.",
  "19": "Now click on the dropdown menu to add other information.",
  "20": "Here select the countries to which you want to export and once done click on Save & Next.",
  "21": "Click on NO.",
  "22": "Select the document type to be attached. Upload it, rename it, and click on Upload Attachments.",
  "23": "Click on Save & Next till the status bar shows like this.",
  "24": "If you have not paid for RCMC yet through any other platforms, click on Payment for RCMC button. This will redirect you to your respective payment gateway to pay the amount.",
  "25": "After payment, you will be redirected to this page where you will have to scroll down.",
  "26": "Here select your created e-RCMC request and select view more.",
  "27": "Now on clicking on Action, you can select what to do, i.e., see payment status, print the payment receipt, etc.",
  "28": "You will have to wait for 3 working days for your RCMC to be verified. You can view your e-RCMC status by clicking on the red button.",
  "29": "To download your e-RCMC, select Submitted Applications in the My Dashboard in Navigation bar.",
  "30": "Select issuance of e-RCMC and click on Search. The rest of the steps are similar to downloading the payment receipt of e-RCMC."
}